use ssafit;

# 클럽 더미 데이터
# 티볼 클럽
INSERT INTO club (ClubID, GameID, Location, ClubLogoPath, ClubContent) 

VALUES  # teeball clubs
		('느려터진 거북이', '티볼', '서울 성북구', 'https://i.namu.wiki/i/ykT3c71F6tEoEUvT_00gfbMvkrnFyKUmeU7bnXXbfJMDM9e9NnDIgr18thf29jjafHGYBJ5k0EPIvxdRaqiNzg.webp', 'laliga'),
		('레전드홍쪽이예절주입기신승호', '티볼', '서울 강남구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcROltHpz-8dDFrwNvLDYuVUIMbSVYmO8Ma5WA&s', 'premier'),
		('논란제조기 육민우', '티볼', '서울 동작구','httpvg', 'ohjh'),
		('김윤홍왼쪽팔 최힘찬', '티볼', '서울 송파구','httg', 'beer'),
		('어금니절도범 배성진', '티볼', '서울 마포구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTNmbFVL9-zICpWk5uwlbNtztKlXHR-FOBcuw&s','island'),
		('Haley 추종자', '티볼', '서울 서초구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmJvdCn-XGBT7_T_ZE73fuZrmu45FpxZjFDA&s','island'),
		('신암초일짱이재영', '티볼', '서울 종로구', 'httpebp','island'),
		('한남더힐입주자모임', '티볼', '서울 용산구', 'httebp','island'),
		# vicvollleyball 클럽
		('강서 김피탕', '빅발리볼', '서울 강서구','', 'https://mobile.fcseoul.com/resources/front/images/sub/club/img_club_emblem01.jpg'),
		('송파 파워레인저', '빅발리볼', '서울 송파구','logopath', 'premier'),
		('강북 불주먹', '빅발리볼', '서울 강북구', 'logopath','ohjh'),
		('헬로키티송창용', '빅발리볼', '서울 관악구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQoaEUBk4wT9pagZL0rD38ikVdZMU6ZiYhCzA&s','beer'),
		('치이카와', '빅발리볼', '서울 강동구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSjfjKihVIzpZxLUQKfdcJoyusyOU6bldO5WQ&s','island'),
		('유캔콜미택', '빅발리볼', '서울 중구', 'httpwebp','island'),
		('이세돌화이팅', '빅발리볼', '서울 서초구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGETshQUqMWtpuNgkTNl2bK-FpdoAFBS0VPg&s','island'),
		('윈터좋아하는김재현', '빅발리볼', '서울 마포구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSbLSIfv2ir_L31OQUKMlmbQRl0mlfrAOyqPg&s','island'),
		# indiaca 클럽
		('수원 FC', '인디아카', '서울 마포구', 'hs','laliga'),
		('SSG', '인디아카', '서울 노원구','httppg', 'premier'),
		('넥스트레벨', '인디아카', '서울 도봉구', 'httpg','ohjh'),
		('핑크 블러드', '인디아카', '서울 광진구','httng', 'beer'),
		('Aespa', '인디아카', '서울 용산구', 'httppg','island'),
		('Supernova', '인디아카', '서울 성동구', 'httpebp','island'),
		('카리나S2한도형', '인디아카', '서울 동대문구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjmvbP0pBEDw02M8LcYG7iMzd17SKLVXp5RA&s','island'),
		('유지민사랑해-육민우', '인디아카', '서울 동작구', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQccmXHHgeTokXkhvTtTThihJEX2SgHSwDyCQ&s','island'),
		# tchouball 클럽
		('맨스티어 파이팅', '츄크볼', '서울 서초구','logopath', 'laliga'),
		('프응TV좋아요구독', '츄크볼', '서울 종로구','logopath', 'premier'),
		('붉은남자송창용', '츄크볼', '서울 중구','logopath', 'ohjh'),
		('달려라 티볼', '츄크볼', '서울 은평구','logopath', 'beer'),
		('김치 너무 매워요', '츄크볼', '서울 구로구','logopath', 'island'),
		('나루토사스케', '츄크볼', '서울 마포구', 'hbp','island'),
		('모루모루쨩', '츄크볼', '서울 도봉구', 'htbp','island'),
		('인성고등학교총동문회', '츄크볼', '서울 강북구', 'httebp','island'),
		# floorball 클럽
		('경산실버타운일동', '플로어볼', '서울 광진구', 'logopath','laliga'),
		('카리나닝닝지젤원터', '플로어볼', '서울 성동구', 'logopath','premier'),
		('오이안먹는모임', '서울 서대문구', 'seoul','logopath', 'ohjh'),
		('힛 앤 런', '플로어볼', '서울 중랑구','logopath', 'beer'),
		('티볼 갤러리', '플로어볼', '서울 관악구', 'logopath','island'),
		('영차 영차', '플로어볼', '서울 영등포구', 'httpbp','island'),
		('베이컨토마토디럭스', '플로어볼', '서울 마포구', 'httpsebp','island'),
		('오징어낙지', '플로어볼', '서울 송파구', 'httpbp','island'),
		# sportstacking 클럽
		('오마이걸 미라클', '스포츠스태킹', '서울 금천구','logopath', 'laliga'),
		('아이브공식팬클럽', '스포츠스태킹', '서울 양천구', 'logopath','premier'),
		('원숭이 킬러', '스포츠스태킹', '서울 강남구', 'logopath','ohjh'),
		('차가운 청년들', '스포츠스태킹', '서울 동대문구','logopath', 'beer'),
		('정처기탈락클럽', '스포츠스태킹', '서울 성동구','logopath', 'island'),
		('A형 클럽', '스포츠스태킹', '서울 강남구', 'httpbp','island'),
		('아침부터모하닝', '스포츠스태킹', '서울 관악구', 'httpsebp','island'),
		('6630', '스포츠스태킹', '서울 노원구', 'httpebp','island');

# select * from club;


# 유저 더미 데이터
INSERT INTO user (UserID, UserPW, Username, UserRRN, UserPhonenumber, UserNickname)
VALUES  ('admin', 'admin', 'admin', '000000-0', '000-0000-0000', '관리자 계정'), 
		('test', 'test', '테스트계정', '123456-7', '010-1234-5678', '테스트 계정'), 
		('j990809@naver.com', 'dlwodud1!', '이재영', '990809-1', '010-3355-3519', 'zl존재영S2'), 
		('bae990429@naver.com', 'bae1234!', '배성진', '990429-1', '010-2885-0849', '느려터진거북이'), 
		('yngbao97', 'dkssud12!', '육예진', '970418-2', '010-4620-6748', '소문난육공주'), 
		('p1ayer.one.potter@gmail.com', 'itzy', '임가현', '000202-4', '010-8422-8393', '레디플레이어원'), 
		('qwera1997@naver.com', 'yukganzi1997@', '육민우', '970704-1', '010-4471-6266', '육땃쥐'), 
		('niggaud@naver.com', 'asdfghjkl98!', '김재현', '980714-1', '010-9484-8129', '럭포터 원챔'),
		('haneul01@naver.com', 'hanblue001', '신승호', '630512-1', '010-5121-0021', 'AzureSky'),
		('minsu02@naver.com', 'msbear002', '김현재', '840307-1', '010-3071-0345', 'BearPaw'),
		('soojin03@naver.com', 'sjstar003', '김기창', '761021-1', '010-2103-0721', 'TwinkleSta'),
		('hyeok04@naver.com', 'hyfire004', '임세하', '710405-1', '010-5401-0432', 'Fireblade'),
		('haein05@naver.com', 'haeocean005', '송창용', '890720-1', '010-2072-0523', 'OceanView'),
		('eunji06@naver.com', 'eunmoon006', '한도형', '910510-1', '010-0510-0661', '쿠키아빠'),
		('junwoo07@naver.com', 'jwcloud007', '문선정', '960814-1', '010-1408-0772', '레몬셔벗블렌디드'),
		('yeonwoo08@naver.com', 'ywplanet008', '서희', '990201-1', '010-2001-0883', '서희장군'),
		('yujin09@naver.com', 'yjrocket009', '권용수', '940620-1', '010-0620-0994', '커피내기'),
		('soyeon10@naver.com', 'sywind010', '박건택', '950328-1', '010-0328-1005', 'WindSwept'),
		('hyunwoo11@naver.com', 'hwstorm011', '박희연', '980913-1', '010-0913-1116', 'StormRider'),
		('minji12@naver.com', 'mjapple012', '민예림', '970207-1', '010-0207-1227', 'AppleCrisp'),
		('daehyun13@naver.com', 'dhgreen013', '홍주형', '950709-1', '010-0709-1338', '서울7반차은우'),
		('jihoon14@naver.com', 'jhaura014', '한진형', '940512-1', '010-0512-1449', '바나프레소'),
		('haneul15@naver.com', 'hnspace015', '오지혜', '960325-1', '010-0325-1550', 'SpaceNomad'),
		('seojun16@naver.com', 'sjwave016', '손영준', '970415-1', '010-0415-1661', '댄싱머신한도형'),
		('yeseo17@naver.com', 'ysfantasy017', '유서현', '991003-1', '010-1003-1772', 'atlantis'),
		('hyebin18@naver.com', 'hbwind018', '황민욱', '950622-1', '010-0622-1883', '쿠키런'),
		('jiwoo19@naver.com', 'jwdream019', '표다영', '970818-1', '010-0818-1994', '싸피11기'),
		('eunwoo20@naver.com', 'ewstar020', '이현우', '980319-1', '010-0319-2005', 'sunglass'),
        ('suji03@naver.com', 'starshine103', '최장우', '761021-1', '010-1003-0103', 'StarShine'),
		('taehun04@naver.com', 'firewalk104', '김주형', '710405-1', '010-1004-0104', 'FireWalker'),
        ('joowon07@naver.com', 'cloudsurf107', '김윤홍', '960814-1', '010-1007-0107', '김윤홍');
# SELECT * FROM user;




# 게시글 더미 데이터
INSERT INTO post (postTitle, userID, userNickname, postContent) 
VALUES 
		('티볼 경험 나눔', 'j990809@naver.com', 'zl존재영S2', '처음으로 티볼을 해봤는데 정말 재미있네요! 같이 할 사람들을 찾습니다.'),
		('인디아카 기본 규칙', 'yujin09@naver.com', '커피내기', '인디아카의 기본적인 규칙과 게임 방법을 공유합니다.'),
		('스태킹 초보자 가이드', 'soojin03@naver.com', 'TwinkleSta', '스태킹을 시작하는 초보자를 위한 기본 가이드입니다.'),
		('플로어볼 입문', 'hyeok04@naver.com', 'Fireblade', '플로어볼을 시작하고 싶은데 어떻게 해야 할지 모르겠다면 이 글을 참고하세요.'),
		('츄크볼 게임 후기', 'soyeon10@naver.com', 'WindSwept', '츄크볼 게임을 해보고 느낀 점을 공유합니다. 역동적이고 흥미로운 게임이에요.'),
		('빅발리볼 후기', 'p1ayer.one.potter@gmail.com', '레디플레이어원', '빅발리볼을 처음 해봤는데, 팀 스포츠의 매력이 넘칩니다!'),
		('인디아카 게임 후기', 'junwoo07@naver.com', '레몬셔벗블렌디드', '인디아카 게임을 처음 해봤습니다. 신선하고 재미있어요!'),
		('스태킹 대회 준비', 'haneul01@naver.com', 'AzureSky', '스포츠스태킹 대회를 준비하면서 배운 점들을 공유합니다.'),
		('플로어볼 팀 모집', 'eunji06@naver.com', '쿠키아빠', '서울에서 활동할 플로어볼 팀원을 찾습니다. 함께 운동해요!'),
		('빅발리볼 기술 팁', 'niggaud@naver.com', '럭포터 원챔', '서브와 스매시를 향상시킬 수 있는 빅발리볼 팁을 공유합니다.'),
		('츄크볼 대회 소식', 'hyunwoo11@naver.com', 'StormRider', '다가오는 츄크볼 대회 소식과 참가 방법을 알려드립니다.'),
		('티볼 클럽 모집', 'bae990429@naver.com', '느려터진거북이', '서울 마포구에서 활동할 티볼 동아리원을 모집합니다. 초보자도 환영!'),
		('플로어볼 경기 후기', 'haneul15@naver.com', 'SpaceNomad', '플로어볼 경기에 참가했던 소감과 후기를 나눕니다.'),
		('인디아카 동호회 소개', 'yeonwoo08@naver.com', '서희장군', '저희 인디아카 동호회에 대해 소개하고 싶어요. 많은 관심 부탁드립니다.'),
		('스태킹 기술과 노하우', 'minsu02@naver.com', 'BearPaw', '스포츠스태킹을 더 빠르게 할 수 있는 기술을 소개합니다.'),
		('플로어볼 장비 추천', 'haein05@naver.com', 'OceanView', '플로어볼을 시작할 때 필요한 장비와 추천 제품을 알려드립니다.'),
		('츄크볼 기술 소개', 'minji12@naver.com', 'AppleCrisp', '츄크볼에서 유용한 기술과 전략을 소개합니다.'),
		('빅발리볼 대회 정보 공유', 'qwera1997@naver.com', '육땃쥐', '다가오는 주말에 서울에서 열리는 빅발리볼 대회 정보입니다.'),
		('티볼 게임 규칙 설명', 'yngbao97', '소문난육공주', '티볼 게임의 기본 규칙과 재미있는 플레이 방법을 공유합니다.'),
		('츄크볼 게임 규칙 소개', 'yeseo17@naver.com', 'atlantis', '츄크볼 게임을 시작하기 전 알아야 할 기본 규칙을 설명합니다.'),
		('빅발리볼 경기장 추천', 'jiwoo19@naver.com', '싸피11기', '서울에서 빅발리볼을 즐길 수 있는 최고의 경기장을 추천합니다.'),
		('티볼 게임 후기 및 팁', 'eunwoo20@naver.com', 'sunglass', '티볼 게임을 하며 얻은 재미있는 경험과 유용한 팁을 공유합니다.'),
		('스포츠스태킹 동아리 모집', 'hyebin18@naver.com', '쿠키런', '스포츠스태킹에 관심 있는 분들을 위한 동아리를 모집합니다.'),
		('서울 티볼 동아리 모집', 'daehyun13@naver.com', '서울7반차은우', '서울 지역에서 활동 중인 티볼 동아리원을 모집합니다.'),
		('인디아카 대회 초대', 'seojun16@naver.com', '댄싱머신한도형', '오는 주말에 열리는 인디아카 대회에 여러분을 초대합니다.'),
		('빅발리볼 초보자 모집', 'jihoon14@naver.com', '바나프레소', '빅발리볼을 시작하는 초보자를 위한 모임을 구성합니다.');


# 댓글 더미 데이터
INSERT INTO Comment(UserID,PostID, UserNickname, CommentContent)
VALUES('j990809@naver.com', 1, 'zl존재영S2', '폼 미쳤다'); 




# 리그 더미 데이터
# (대회명, 종목, 경기 날짜, 경기 장소, 기준팀, 상대팀, 득점, 실점, 승점, 결과)
# (승점(Points): 이기면 3점, 비기면 1점, 지면 0점)
# (경기 결과(Result): 이기면 1, 비기면 2, 지면 3)
# (대회명은 종목을 영어로 한것, teeball / vicvalleyball / indiaca, tchouball ,floorball , sportstacking)

# 티볼 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
		-- Round 1
		('TEEBALL CUP', '티볼', '2024-05-01', '서울 성북구', '느려터진 거북이', '레전드홍쪽이예절주입기신승호', 13, 12, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-01', '서울 성북구', '레전드홍쪽이예절주입기신승호', '느려터진 거북이', 12, 13, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-02', '서울 동작구', '논란제조기 육민우', '김윤홍왼쪽팔 최힘찬', 14, 11, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-02', '서울 동작구', '김윤홍왼쪽팔 최힘찬', '논란제조기 육민우', 11, 14, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-03', '서울 마포구', '어금니절도범 배성진', 'Haley 추종자', 8, 9, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-03', '서울 마포구', 'Haley 추종자', '어금니절도범 배성진', 9, 8, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-04', '서울 종로구', '신암초일짱이재영', '한남더힐입주자모임', 20, 20, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-04', '서울 종로구', '한남더힐입주자모임', '신암초일짱이재영', 20, 20, 1, 2),

		-- Round 2
		('TEEBALL CUP', '티볼', '2024-05-05', '서울 성북구', '느려터진 거북이', '논란제조기 육민우', 5, 0, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-05', '서울 성북구', '논란제조기 육민우', '느려터진 거북이', 0, 5, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-06', '서울 동작구', '김윤홍왼쪽팔 최힘찬', 'Haley 추종자', 2, 3, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-06', '서울 동작구', 'Haley 추종자', '김윤홍왼쪽팔 최힘찬', 3, 2, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-07', '서울 마포구', '어금니절도범 배성진', '신암초일짱이재영', 14, 14, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-07', '서울 마포구', '신암초일짱이재영', '어금니절도범 배성진', 14, 14, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-08', '서울 종로구', '한남더힐입주자모임', '레전드홍쪽이예절주입기신승호', 1, 1, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-08', '서울 종로구', '레전드홍쪽이예절주입기신승호', '한남더힐입주자모임', 1, 1, 1, 2),

		-- Round 3
		('TEEBALL CUP', '티볼', '2024-05-09', '서울 성북구', '느려터진 거북이', '어금니절도범 배성진', 3, 1, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-09', '서울 성북구', '어금니절도범 배성진', '느려터진 거북이', 1, 3, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-10', '서울 강남구', '레전드홍쪽이예절주입기신승호', '신암초일짱이재영', 12, 10, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-10', '서울 강남구', '신암초일짱이재영', '레전드홍쪽이예절주입기신승호', 10, 12, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-11', '서울 동작구', '논란제조기 육민우', 'Haley 추종자', 6, 6, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-11', '서울 동작구', 'Haley 추종자', '논란제조기 육민우', 6, 6, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-12', '서울 송파구', '김윤홍왼쪽팔 최힘찬', '한남더힐입주자모임', 3, 2, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-12', '서울 송파구', '한남더힐입주자모임', '김윤홍왼쪽팔 최힘찬', 2, 3, 0, 3),

		-- Round 4
		('TEEBALL CUP', '티볼', '2024-05-13', '서울 성북구', '느려터진 거북이', '신암초일짱이재영', 10, 11, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-13', '서울 성북구', '신암초일짱이재영', '느려터진 거북이', 11, 10, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-14', '서울 강남구', '레전드홍쪽이예절주입기신승호', 'Haley 추종자', 2, 2, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-14', '서울 강남구', 'Haley 추종자', '레전드홍쪽이예절주입기신승호', 2, 2, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-15', '서울 동작구', '논란제조기 육민우', '어금니절도범 배성진', 21, 23, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-15', '서울 동작구', '어금니절도범 배성진', '논란제조기 육민우', 23, 21, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-16', '서울 송파구', '김윤홍왼쪽팔 최힘찬', '레전드홍쪽이예절주입기신승호', 0, 0, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-16', '서울 송파구', '레전드홍쪽이예절주입기신승호', '김윤홍왼쪽팔 최힘찬', 0, 0, 1, 2),

		-- Round 5
		('TEEBALL CUP', '티볼', '2024-05-17', '서울 마포구', 'Haley 추종자', '느려터진 거북이', 12, 11, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-17', '서울 마포구', '느려터진 거북이', 'Haley 추종자', 11, 12, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-18', '잠실 주경기장', '신암초일짱이재영', '논란제조기 육민우', 3, 3, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-18', '잠실 주경기장', '논란제조기 육민우', '신암초일짱이재영', 3, 3, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-19', '잠실 주경기장', '느려터진 거북이', '김윤홍왼쪽팔 최힘찬', 1, 4, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-19', '잠실 주경기장', '김윤홍왼쪽팔 최힘찬', '느려터진 거북이', 4, 1, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-20', '잠실 주경기장', '레전드홍쪽이예절주입기신승호', '어금니절도범 배성진', 0, 1, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-20', '잠실 주경기장', '어금니절도범 배성진', '레전드홍쪽이예절주입기신승호', 1, 0, 3, 1),

		-- Round 6
		('TEEBALL CUP', '티볼', '2024-05-21', '잠실 주경기장', '논란제조기 육민우', 'Haley 추종자', 14, 12, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-21', '잠실 주경기장', 'Haley 추종자', '논란제조기 육민우', 12, 14, 0, 3),
		('TEEBALL CUP', '티볼', '2024-05-22', '잠실 주경기장', '김윤홍왼쪽팔 최힘찬', '신암초일짱이재영', 12, 12, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-22', '잠실 주경기장', '신암초일짱이재영', '김윤홍왼쪽팔 최힘찬', 12, 12, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-23', '잠실 주경기장', '어금니절도범 배성진', '느려터진 거북이', 13, 13, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-23', '잠실 주경기장', '느려터진 거북이', '어금니절도범 배성진', 13, 13, 1, 2),
		('TEEBALL CUP', '티볼', '2024-05-24', '잠실 주경기장', '한남더힐입주자모임', '레전드홍쪽이예절주입기신승호', 11, 10, 3, 1),
		('TEEBALL CUP', '티볼', '2024-05-24', '잠실 주경기장', '레전드홍쪽이예절주입기신승호', '한남더힐입주자모임', 10, 11, 0, 3);


# 빅발리볼 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
		-- Round 1
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-01', '서울 강서구', '강서 김피탕', '송파 파워레인저', 3, 2, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-01', '서울 강서구', '송파 파워레인저', '강서 김피탕', 2, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-02', '서울 강북구', '강북 불주먹', '헬로키티송창용', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-02', '서울 강북구', '헬로키티송창용', '강북 불주먹', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-03', '서울 강동구', '치이카와', '유캔콜미택', 3, 0, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-03', '서울 강동구', '유캔콜미택', '치이카와', 0, 3, 0, 3),

		-- Round 2
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-04', '서울 중구', '유캔콜미택', '이세돌화이팅', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-04', '서울 중구', '이세돌화이팅', '유캔콜미택', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-05', '서울 서초구', '이세돌화이팅', '윈터좋아하는김재현', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-05', '서울 서초구', '윈터좋아하는김재현', '이세돌화이팅', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-06', '서울 강서구', '강서 김피탕', '강북 불주먹', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-06', '서울 강서구', '강북 불주먹', '강서 김피탕', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-07', '서울 관악구', '헬로키티송창용', '치이카와', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-07', '서울 관악구', '치이카와', '헬로키티송창용', 3, 1, 3, 1),

		-- Round 3
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-08', '서울 송파구', '송파 파워레인저', '유캔콜미택', 0, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-08', '서울 송파구', '유캔콜미택', '송파 파워레인저', 3, 0, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-09', '서울 마포구', '윈터좋아하는김재현', '이세돌화이팅', 3, 2, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-09', '서울 마포구', '이세돌화이팅', '윈터좋아하는김재현', 2, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-10', '서울 강동구', '치이카와', '송파 파워레인저', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-10', '서울 강동구', '송파 파워레인저', '치이카와', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-11', '서울 중구', '유캔콜미택', '강북 불주먹', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-11', '서울 중구', '강북 불주먹', '유캔콜미택', 1, 3, 0, 3),

		-- Round 4
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-12', '서울 강서구', '강서 김피탕', '헬로키티송창용', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-12', '서울 강서구', '헬로키티송창용', '강서 김피탕', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-13', '서울 관악구', '치이카와', '이세돌화이팅', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-13', '서울 관악구', '이세돌화이팅', '치이카와', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-14', '서울 송파구', '송파 파워레인저', '헬로키티송창용', 3, 4, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-14', '서울 송파구', '헬로키티송창용', '송파 파워레인저', 4, 3, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-15', '서울 강북구', '강북 불주먹', '유캔콜미택', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-15', '서울 강북구', '유캔콜미택', '강북 불주먹', 3, 1, 3, 1),

		-- Round 5
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-20', '고척돔', '강서 김피탕', '윈터좋아하는김재현', 3, 0, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-20', '고척돔', '윈터좋아하는김재현', '강서 김피탕', 0, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-21', '고척돔', '윈터좋아하는김재현', '송파 파워레인저', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-21', '고척돔', '송파 파워레인저', '윈터좋아하는김재현', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-22', '고척돔', '강서 김피탕', '유캔콜미택', 3, 1, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-22', '고척돔', '유캔콜미택', '강서 김피탕', 1, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-22', '고척돔', '송파 파워레인저', '헬로키티송창용', 2, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-22', '고척돔', '헬로키티송창용', '송파 파워레인저', 3, 2, 3, 1),

		-- Round 6
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-23', '고척돔', '강북 불주먹', '치이카와', 3, 0, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-23', '고척돔', '치이카와', '강북 불주먹', 0, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-23', '고척돔', '헬로키티송창용', '이세돌화이팅', 2, 3, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-23', '고척돔', '이세돌화이팅', '헬로키티송창용', 3, 2, 3, 1),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-24', '고척돔', '치이카와', '윈터좋아하는김재현', 3, 4, 0, 3),
		('VICVOLLEYBALL CUP', '빅발리볼', '2024-05-24', '고척돔', '윈터좋아하는김재현', '치이카와', 4, 3, 3, 1);



# 인디아카 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
		-- Round 1
		('INDIACA CUP', '인디아카', '2024-05-01', '서울 마포구', '수원 FC', 'SSG', 3, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-01', '서울 마포구', 'SSG', '수원 FC', 1, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-02', '서울 도봉구', '넥스트레벨', '핑크 블러드', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-02', '서울 도봉구', '핑크 블러드', '넥스트레벨', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-03', '서울 용산구', 'Aespa', 'Supernova', 1, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-03', '서울 용산구', 'Supernova', 'Aespa', 3, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-04', '서울 동대문구', '카리나S2한도형', '유지민사랑해-육민우', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-04', '서울 동대문구', '유지민사랑해-육민우', '카리나S2한도형', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-05', '서울 노원구', 'SSG', '넥스트레벨', 0, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-05', '서울 노원구', '넥스트레벨', 'SSG', 3, 0, 3, 1),
        
        -- Round 2
		('INDIACA CUP', '인디아카', '2024-05-06', '서울 마포구', '수원 FC', '핑크 블러드', 2, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-06', '서울 마포구', '핑크 블러드', '수원 FC', 0, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-07', '서울 노원구', 'SSG', 'Aespa', 3, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-07', '서울 노원구', 'Aespa', 'SSG', 1, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-08', '서울 도봉구', '넥스트레벨', 'Supernova', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-08', '서울 도봉구', 'Supernova', '넥스트레벨', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-09', '서울 동대문구', '카리나S2한도형', '유지민사랑해-육민우', 0, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-09', '서울 동대문구', '유지민사랑해-육민우', '카리나S2한도형', 2, 0, 3, 1),

		-- Round 3
		('INDIACA CUP', '인디아카', '2024-05-10', '서울 마포구', '수원 FC', 'SSG', 3, 3, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-10', '서울 마포구', 'SSG', '수원 FC', 3, 3, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-11', '서울 도봉구', '넥스트레벨', 'Aespa', 1, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-11', '서울 도봉구', 'Aespa', '넥스트레벨', 0, 1, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-12', '서울 광진구', '핑크 블러드', 'Supernova', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-12', '서울 광진구', 'Supernova', '핑크 블러드', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-13', '서울 노원구', '카리나S2한도형', 'SSG', 1, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-13', '서울 노원구', 'SSG', '카리나S2한도형', 3, 1, 3, 1),

		-- Round 4
		('INDIACA CUP', '인디아카', '2024-05-14', '서울 동작구', '유지민사랑해-육민우', 'Aespa', 0, 0, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-14', '서울 동작구', 'Aespa', '유지민사랑해-육민우', 0, 0, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-15', '서울 광진구', '핑크 블러드', '넥스트레벨', 2, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-15', '서울 광진구', '넥스트레벨', '핑크 블러드', 1, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-16', '서울 성동구', 'Supernova', '수원 FC', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-16', '서울 성동구', '수원 FC', 'Supernova', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-17', '서울 동대문구', '카리나S2한도형', '핑크 블러드', 3, 2, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-17', '서울 동대문구', '핑크 블러드', '카리나S2한도형', 2, 3, 0, 3),

		-- Round 5
		('INDIACA CUP', '인디아카', '2024-05-18', '서울 장충체육관', 'SSG', '유지민사랑해-육민우', 2, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-18', '서울 장충체육관', '유지민사랑해-육민우', 'SSG', 0, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-19', '서울 장충체육관', 'Aespa', '넥스트레벨', 1, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-19', '서울 장충체육관', '넥스트레벨', 'Aespa', 3, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-20', '서울 장충체육관', 'Supernova', '유지민사랑해-육민우', 1, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-20', '서울 장충체육관', '유지민사랑해-육민우', 'Supernova', 0, 1, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-21', '서울 장충체육관', '수원 FC', '카리나S2한도형', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-21', '서울 장충체육관', '카리나S2한도형', '수원 FC', 2, 2, 1, 2),

		-- Round 6
		('INDIACA CUP', '인디아카', '2024-05-22', '서울 장충체육관', '수원 FC', '넥스트레벨', 2, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-22', '서울 장충체육관', '넥스트레벨', '수원 FC', 3, 2, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-23', '서울 장충체육관', 'SSG', '핑크 블러드', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-23', '서울 장충체육관', '핑크 블러드', 'SSG', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-24', '서울 장충체육관', 'Aespa', '카리나S2한도형', 0, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-24', '서울 장충체육관', '카리나S2한도형', 'Aespa', 2, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-25', '서울 장충체육관', 'Supernova', '유지민사랑해-육민우', 3, 1, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-25', '서울 장충체육관', '유지민사랑해-육민우', 'Supernova', 1, 3, 0, 3),

		-- Round 7
		('INDIACA CUP', '인디아카', '2024-05-21', '서울 장충체육관', '수원 FC', '핑크 블러드', 3, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-21', '서울 장충체육관', '핑크 블러드', '수원 FC', 0, 3, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-22', '서울 장충체육관', 'SSG', 'Supernova', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-22', '서울 장충체육관', 'Supernova', 'SSG', 2, 2, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-23', '서울 장충체육관', '넥스트레벨', '유지민사랑해-육민우', 1, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-23', '서울 장충체육관', '유지민사랑해-육민우', '넥스트레벨', 0, 1, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-24', '서울 장충체육관', 'Aespa', '강서 김피탕', 1, 1, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-24', '서울 장충체육관', '강서 김피탕', 'Aespa', 1, 1, 1, 2),

		-- Round 8
		('INDIACA CUP', '인디아카', '2024-05-30', '서울 장충체육관', '카리나S2한도형', '넥스트레벨', 2, 0, 3, 1),
		('INDIACA CUP', '인디아카', '2024-05-30', '서울 장충체육관', '넥스트레벨', '카리나S2한도형', 0, 2, 0, 3),
		('INDIACA CUP', '인디아카', '2024-05-31', '서울 장충체육관', '핑크 블러드', 'Supernova', 3, 3, 1, 2),
		('INDIACA CUP', '인디아카', '2024-05-31', '서울 장충체육관', 'Supernova', '핑크 블러드', 3, 3, 1, 2);



# 츄크볼 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
	-- Round 1
	('TCHOUKBALL CUP', '츄크볼', '2024-05-01', '서울 서초구', '맨스티어 파이팅', '프응TV좋아요구독', 10, 13, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-01', '서울 서초구', '프응TV좋아요구독', '맨스티어 파이팅', 13, 10, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-02', '서울 중구', '붉은남자송창용', '달려라 티볼', 27, 31, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-02', '서울 중구', '달려라 티볼', '붉은남자송창용', 31, 27, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-03', '서울 구로구', '김치 너무 매워요', '나루토사스케', 15, 15, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-03', '서울 구로구', '나루토사스케', '김치 너무 매워요', 15, 15, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-04', '서울 도봉구', '모루모루쨩', '인성고등학교총동문회', 8, 9, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-04', '서울 도봉구', '인성고등학교총동문회', '모루모루쨩', 9, 8, 3, 1),

	-- Round 2
	('TCHOUKBALL CUP', '츄크볼', '2024-05-05', '서울 서초구', '맨스티어 파이팅', '붉은남자송창용', 14, 20, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-05', '서울 서초구', '붉은남자송창용', '맨스티어 파이팅', 20, 14, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-06', '서울 종로구', '프응TV좋아요구독', '달려라 티볼', 19, 19, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-06', '서울 종로구', '달려라 티볼', '프응TV좋아요구독', 19, 19, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-07', '서울 도봉구', '모루모루쨩', '맨스티어 파이팅', 22, 18, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-07', '서울 도봉구', '맨스티어 파이팅', '모루모루쨩', 18, 22, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-08', '서울 강북구', '인성고등학교총동문회', '김치 너무 매워요', 16, 20, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-08', '서울 강북구', '김치 너무 매워요', '인성고등학교총동문회', 20, 16, 3, 1),

	-- Round 3
	('TCHOUKBALL CUP', '츄크볼', '2024-05-09', '서울 종로구', '프응TV좋아요구독', '나루토사스케', 24, 24, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-09', '서울 종로구', '나루토사스케', '프응TV좋아요구독', 24, 24, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-10', '서울 은평구', '달려라 티볼', 'Supernova', 21, 17, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-10', '서울 은평구', 'Supernova', '달려라 티볼', 17, 21, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-11', '서울 구로구', '김치 너무 매워요', '맨스티어 파이팅', 15, 13, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-11', '서울 구로구', '맨스티어 파이팅', '김치 너무 매워요', 13, 15, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-12', '서울 도봉구', '모루모루쨩', '프응TV좋아요구독', 14, 12, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-12', '서울 도봉구', '프응TV좋아요구독', '모루모루쨩', 12, 14, 0, 3),

	-- Round 4
	('TCHOUKBALL CUP', '츄크볼', '2024-05-13', '서울 강북구', '인성고등학교총동문회', '나루토사스케', 19, 21, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-13', '서울 강북구', '나루토사스케', '인성고등학교총동문회', 21, 19, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-14', '서울 성동구', '달려라 티볼', 'Supernova', 20, 20, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-14', '서울 성동구', 'Supernova', '달려라 티볼', 20, 20, 1, 2),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-15', '서울 서초구', '맨스티어 파이팅', '김치 너무 매워요', 17, 15, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-15', '서울 서초구', '김치 너무 매워요', '맨스티어 파이팅', 15, 17, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-16', '서울 도봉구', '모루모루쨩', '달려라 티볼', 16, 18, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-16', '서울 도봉구', '달려라 티볼', '모루모루쨩', 18, 16, 3, 1),

	-- Round 5
	('TCHOUKBALL CUP', '츄크볼', '2024-05-17', '서울 종로구', '프응TV좋아요구독', '인성고등학교총동문회', 25, 22, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-17', '서울 종로구', '인성고등학교총동문회', '프응TV좋아요구독', 22, 25, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-18', '서울 마포구', '나루토사스케', 'Supernova', 12, 14, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-18', '서울 마포구', 'Supernova', '나루토사스케', 14, 12, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-19', '서울 서초구', '맨스티어 파이팅', 'Supernova', 13, 16, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-19', '서울 서초구', 'Supernova', '맨스티어 파이팅', 16, 13, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-20', '역삼 멀티캠퍼스 303호', '모루모루쨩', '인성고등학교총동문회', 23, 21, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-20', '역삼 멀티캠퍼스 303호', '인성고등학교총동문회', '모루모루쨩', 21, 23, 0, 3),
    
    -- Round 6
	('TCHOUKBALL CUP', '츄크볼', '2024-05-21', '역삼 멀티캠퍼스 303호', '맨스티어 파이팅', '김치 너무 매워요', 15, 18, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-21', '역삼 멀티캠퍼스 303호', '김치 너무 매워요', '맨스티어 파이팅', 18, 15, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-22', '역삼 멀티캠퍼스 303호', '프응TV좋아요구독', '모루모루쨩', 20, 22, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-22', '역삼 멀티캠퍼스 303호', '모루모루쨩', '프응TV좋아요구독', 22, 20, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-23', '역삼 멀티캠퍼스 303호', '붉은남자송창용', '나루토사스케', 14, 17, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-23', '역삼 멀티캠퍼스 303호', '나루토사스케', '붉은남자송창용', 17, 14, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-24', '역삼 멀티캠퍼스 303호', '달려라 티볼', '인성고등학교총동문회', 21, 24, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-24', '역삼 멀티캠퍼스 303호', '인성고등학교총동문회', '달려라 티볼', 24, 21, 3, 1),

	-- Round 7
	('TCHOUKBALL CUP', '츄크볼', '2024-05-25', '역삼 멀티캠퍼스', '맨스티어 파이팅', 'Supernova', 22, 20, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-25', '역삼 멀티캠퍼스', 'Supernova', '맨스티어 파이팅', 20, 22, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-20', '역삼 멀티캠퍼스 303호', '김치 너무 매워요', '프응TV좋아요구독', 19, 16, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-20', '역삼 멀티캠퍼스 303호', '프응TV좋아요구독', '김치 너무 매워요', 16, 19, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-21', '역삼 멀티캠퍼스 303호', '모루모루쨩', '붉은남자송창용', 12, 14, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-21', '역삼 멀티캠퍼스 303호', '붉은남자송창용', '모루모루쨩', 14, 12, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-22', '역삼 멀티캠퍼스 303호', '나루토사스케', '달려라 티볼', 17, 20, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-22', '역삼 멀티캠퍼스 303호', '달려라 티볼', '나루토사스케', 20, 17, 3, 1),

	-- Round 8
	('TCHOUKBALL CUP', '츄크볼', '2024-05-23', '역삼 멀티캠퍼스 303호', 'Supernova', '인성고등학교총동문회', 13, 11, 3, 1),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-23', '역삼 멀티캠퍼스 303호', '인성고등학교총동문회', 'Supernova', 11, 13, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-24', '역삼 멀티캠퍼스 303호', '맨스티어 파이팅', '나루토사스케', 23, 25, 0, 3),
	('TCHOUKBALL CUP', '츄크볼', '2024-05-24', '역삼 멀티캠퍼스 303호', '나루토사스케', '맨스티어 파이팅', 25, 23, 3, 1);


    


# 플로어볼 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
		-- Round 1
		('FLOORBALL CUP', '플로어볼', '2024-05-01', '서울 싸피체육관', '경산실버타운일동', '카리나닝닝지젤원터', 12, 9, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-01', '서울 싸피체육관', '카리나닝닝지젤원터', '경산실버타운일동', 9, 12, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-02', '서울 싸피체육관', '오이안먹는모임', '힛 앤 런', 10, 14, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-02', '서울 싸피체육관', '힛 앤 런', '오이안먹는모임', 14, 10, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-03', '서울 싸피체육관', '티볼 갤러리', '영차 영차', 15, 15, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-03', '서울 싸피체육관', '영차 영차', '티볼 갤러리', 15, 15, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-04', '서울 싸피체육관', '베이컨토마토디럭스', '오징어낙지', 7, 12, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-04', '서울 싸피체육관', '오징어낙지', '베이컨토마토디럭스', 12, 7, 3, 1),

		-- Round 2
		('FLOORBALL CUP', '플로어볼', '2024-05-05', '서울 싸피체육관', '경산실버타운일동', '힛 앤 런', 13, 20, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-05', '서울 싸피체육관', '힛 앤 런', '경산실버타운일동', 20, 13, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-06', '서울 싸피체육관', '카리나닝닝지젤원터', '오이안먹는모임', 18, 18, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-06', '서울 싸피체육관', '오이안먹는모임', '카리나닝닝지젤원터', 18, 18, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-07', '서울 싸피체육관', '경산실버타운일동', '오이안먹는모임', 16, 13, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-07', '서울 싸피체육관', '오이안먹는모임', '경산실버타운일동', 13, 16, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-07', '서울 싸피체육관', '카리나닝닝지젤원터', '힛 앤 런', 10, 14, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-07', '서울 싸피체육관', '힛 앤 런', '카리나닝닝지젤원터', 14, 10, 3, 1),

		-- Round 3
		('FLOORBALL CUP', '플로어볼', '2024-05-08', '서울 싸피체육관', '티볼 갤러리', '베이컨토마토디럭스', 17, 17, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-08', '서울 싸피체육관', '베이컨토마토디럭스', '티볼 갤러리', 17, 17, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-08', '서울 싸피체육관', '영차 영차', '오징어낙지', 20, 19, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-08', '서울 싸피체육관', '오징어낙지', '영차 영차', 19, 20, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-09', '서울 싸피체육관', '경산실버타운일동', '힛 앤 런', 15, 12, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-09', '서울 싸피체육관', '힛 앤 런', '경산실버타운일동', 12, 15, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-09', '서울 싸피체육관', '오이안먹는모임', '영차 영차', 14, 11, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-09', '서울 싸피체육관', '영차 영차', '오이안먹는모임', 11, 14, 0, 3),

		-- Round 4
		('FLOORBALL CUP', '플로어볼', '2024-05-10', '서울 싸피체육관', '카리나닝닝지젤원터', '베이컨토마토디럭스', 13, 16, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-10', '서울 싸피체육관', '베이컨토마토디럭스', '카리나닝닝지젤원터', 16, 13, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-10', '서울 싸피체육관', '티볼 갤러리', '오징어낙지', 18, 20, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-10', '서울 싸피체육관', '오징어낙지', '티볼 갤러리', 20, 18, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-11', '서울 싸피체육관', '경산실버타운일동', '오징어낙지', 21, 15, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-11', '서울 싸피체육관', '오징어낙지', '경산실버타운일동', 15, 21, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-11', '서울 싸피체육관', '카리나닝닝지젤원터', '영차 영차', 22, 18, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-11', '서울 싸피체육관', '영차 영차', '카리나닝닝지젤원터', 18, 22, 0, 3),

		-- Round 5
		('FLOORBALL CUP', '플로어볼', '2024-05-18', '역삼 멀티캠퍼스', '오이안먹는모임', '베이컨토마토디럭스', 10, 9, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-18', '역삼 멀티캠퍼스', '베이컨토마토디럭스', '오이안먹는모임', 9, 10, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-18', '역삼 멀티캠퍼스', '힛 앤 런', '티볼 갤러리', 17, 20, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-18', '역삼 멀티캠퍼스', '티볼 갤러리', '힛 앤 런', 20, 17, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-19', '서울 싸피체육관', '경산실버타운일동', '힛 앤 런', 19, 19, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-19', '서울 싸피체육관', '힛 앤 런', '경산실버타운일동', 19, 19, 1, 2),
		('FLOORBALL CUP', '플로어볼', '2024-05-20', '서울 싸피체육관', '카리나닝닝지젤원터', '모루모루쨩', 12, 14, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-20', '서울 싸피체육관', '모루모루쨩', '카리나닝닝지젤원터', 14, 12, 3, 1),
        
        -- Round 6
		('FLOORBALL CUP', '플로어볼', '2024-05-21', '서울 싸피체육관', '경산실버타운일동', '오징어낙지', 21, 18, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-21', '서울 싸피체육관', '오징어낙지', '경산실버타운일동', 18, 21, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-21', '서울 싸피체육관', '카리나닝닝지젤원터', '베이컨토마토디럭스', 15, 12, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-21', '서울 싸피체육관', '베이컨토마토디럭스', '카리나닝닝지젤원터', 12, 15, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-22', '서울 싸피체육관', '오이안먹는모임', '힛 앤 런', 19, 20, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-22', '서울 싸피체육관', '힛 앤 런', '오이안먹는모임', 20, 19, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-22', '서울 싸피체육관', '티볼 갤러리', '영차 영차', 16, 14, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-22', '서울 싸피체육관', '영차 영차', '티볼 갤러리', 14, 16, 0, 3),

		-- Round 7
		('FLOORBALL CUP', '플로어볼', '2024-05-23', '서울 싸피체육관', '오징어낙지', '모루모루쨩', 10, 13, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-23', '서울 싸피체육관', '모루모루쨩', '오징어낙지', 13, 10, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-23', '서울 싸피체육관', '경산실버타운일동', '티볼 갤러리', 20, 22, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-23', '서울 싸피체육관', '티볼 갤러리', '경산실버타운일동', 22, 20, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-24', '서울 싸피체육관', '카리나닝닝지젤원터', '오이안먹는모임', 17, 15, 3, 1),
		('FLOORBALL CUP', '플로어볼', '2024-05-24', '서울 싸피체육관', '오이안먹는모임', '카리나닝닝지젤원터', 15, 17, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-24', '서울 싸피체육관', '베이컨토마토디럭스', '힛 앤 런', 14, 18, 0, 3),
		('FLOORBALL CUP', '플로어볼', '2024-05-24', '서울 싸피체육관', '힛 앤 런', '베이컨토마토디럭스', 18, 14, 3, 1);

        

# 스포츠스태킹 리그 데이터
INSERT INTO league (LeagueId, GameId, GameDay, Location, ClubId, OppClubId, GF, GA, Points, Result) 
VALUES
		-- Round 1
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '오마이걸 미라클', '아이브공식팬클럽', 5, 0, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '아이브공식팬클럽', '오마이걸 미라클', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '원숭이 킬러', '차가운 청년들', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '차가운 청년들', '원숭이 킬러', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '정처기탈락클럽', 'A형 클럽', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', 'A형 클럽', '정처기탈락클럽', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '아침부터모하닝', '6630', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-18', '서울 월드컵경기장', '6630', '아침부터모하닝', 3, 2, 3, 1),
        
        -- Round 2
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '오마이걸 미라클', '원숭이 킬러', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '원숭이 킬러', '오마이걸 미라클', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '아이브공식팬클럽', '차가운 청년들', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '차가운 청년들', '아이브공식팬클럽', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '정처기탈락클럽', '아침부터모하닝', 5, 0, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '아침부터모하닝', '정처기탈락클럽', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', 'A형 클럽', '6630', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-19', '서울 월드컵경기장', '6630', 'A형 클럽', 3, 2, 3, 1),

		-- Round 3
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '오마이걸 미라클', '차가운 청년들', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '차가운 청년들', '오마이걸 미라클', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '아이브공식팬클럽', '정처기탈락클럽', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '정처기탈락클럽', '아이브공식팬클럽', 5, 0, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '오마이걸 미라클', '아침부터모하닝', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '아침부터모하닝', '오마이걸 미라클', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '아이브공식팬클럽', '6630', 5, 0, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-20', '서울 월드컵경기장', '6630', '아이브공식팬클럽', 0, 5, 0, 3),

        
		-- Round 4
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '원숭이 킬러', '차가운 청년들', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '차가운 청년들', '원숭이 킬러', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '정처기탈락클럽', 'A형 클럽', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', 'A형 클럽', '정처기탈락클럽', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '아침부터모하닝', '6630', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '6630', '아침부터모하닝', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', '오마이걸 미라클', 'A형 클럽', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-21', '서울 월드컵경기장', 'A형 클럽', '오마이걸 미라클', 5, 0, 3, 1),

		-- Round 5
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '아이브공식팬클럽', '원숭이 킬러', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '원숭이 킬러', '아이브공식팬클럽', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '차가운 청년들', '정처기탈락클럽', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '정처기탈락클럽', '차가운 청년들', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '오마이걸 미라클', '힛 앤 런', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '힛 앤 런', '오마이걸 미라클', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '아이브공식팬클럽', '6630', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-22', '서울 월드컵경기장', '6630', '아이브공식팬클럽', 1, 4, 0, 3),

		-- Round 6
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '원숭이 킬러', '차가운 청년들', 5, 0, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '차가운 청년들', '원숭이 킬러', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '정처기탈락클럽', 'A형 클럽', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', 'A형 클럽', '정처기탈락클럽', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '아침부터모하닝', '6630', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '6630', '아침부터모하닝', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', '오마이걸 미라클', 'A형 클럽', 0, 5, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-23', '서울 월드컵경기장', 'A형 클럽', '오마이걸 미라클', 5, 0, 3, 1),

		-- Round 7
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '아이브공식팬클럽', '차가운 청년들', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '차가운 청년들', '아이브공식팬클럽', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '정처기탈락클럽', '오이안먹는모임', 4, 1, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '오이안먹는모임', '정처기탈락클럽', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '아침부터모하닝', '6630', 3, 2, 3, 1),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '6630', '아침부터모하닝', 2, 3, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '오마이걸 미라클', '원숭이 킬러', 1, 4, 0, 3),
		('SPORTSTACKING CUP', '스포츠스태킹', '2024-05-24', '서울 월드컵경기장', '원숭이 킬러', '오마이걸 미라클', 4, 1, 3, 1);


# SELECT * FROM league;

